docs: reemplazar diagrama mermaid con plantuml
